#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_string.storage_suffix: Refreshing state... [id=y7tqlo]
azurerm_resource_group.avd: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev]
module.networking.azurerm_public_ip.nat_gateway_public_ip: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/publicIPAddresses/avd-poc-nat-gateway-pip]
module.networking.azurerm_nat_gateway.nat_gateway: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/natGateways/avd-poc-nat-gateway]
module.networking.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/virtualNetworks/avd-poc-vnet]
module.networking.azurerm_private_dns_zone.private_dns_zone: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net]
module.networking.azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/networkSecurityGroups/avd-poc-vnet-nsg]
module.storage.azurerm_storage_account.avd: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Storage/storageAccounts/stavdpocy7tqlo]
module.networking.azurerm_subnet.subnet["storage"]: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/virtualNetworks/avd-poc-vnet/subnets/avd-poc-storage-snet]
module.networking.azurerm_subnet.subnet["avd-hosts"]: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/virtualNetworks/avd-poc-vnet/subnets/avd-poc-avd-hosts-snet]
module.networking.azurerm_nat_gateway_public_ip_association.nat_gateway_public_ip_association: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/natGateways/avd-poc-nat-gateway|/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/publicIPAddresses/avd-poc-nat-gateway-pip]
module.networking.azurerm_subnet_nat_gateway_association.subnet_nat_gateway_association["avd-hosts"]: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/virtualNetworks/avd-poc-vnet/subnets/avd-poc-avd-hosts-snet]
module.networking.azurerm_subnet_network_security_group_association.subnet_nsg_association["storage"]: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/virtualNetworks/avd-poc-vnet/subnets/avd-poc-storage-snet]
module.networking.azurerm_subnet_network_security_group_association.subnet_nsg_association["avd-hosts"]: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/virtualNetworks/avd-poc-vnet/subnets/avd-poc-avd-hosts-snet]
module.networking.azurerm_private_dns_zone_virtual_network_link.private_dns_zone_storage_link: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net/virtualNetworkLinks/avd-poc-vnet-dns-link]
module.storage.azurerm_storage_share.avd: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Storage/storageAccounts/stavdpocy7tqlo/fileServices/default/shares/avdpocshare]
module.storage.azurerm_private_endpoint.avd_storage: Refreshing state... [id=/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/privateEndpoints/avdpocstoragepe]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.avd-hostpool.azurerm_network_interface.avd_nic["0"] will be created
  + resource "azurerm_network_interface" "avd_nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "avd-poc-nic0"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-avd-dev"
      + tags                           = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "avd-poc-nic0-ipconfig"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/virtualNetworks/avd-poc-vnet/subnets/avd-poc-avd-hosts-snet"
        }
    }

  # module.avd-hostpool.azurerm_network_interface.avd_nic["1"] will be created
  + resource "azurerm_network_interface" "avd_nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "avd-poc-nic1"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-avd-dev"
      + tags                           = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "avd-poc-nic1-ipconfig"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/96cfbff9-e68e-4fed-8b7a-eb51e100331f/resourceGroups/rg-avd-dev/providers/Microsoft.Network/virtualNetworks/avd-poc-vnet/subnets/avd-poc-avd-hosts-snet"
        }
    }

  # module.avd-hostpool.azurerm_virtual_desktop_application_group.desktop_app_group will be created
  + resource "azurerm_virtual_desktop_application_group" "desktop_app_group" {
      + description         = "Application group for AVD POC environment"
      + friendly_name       = "AVD POC App Group"
      + host_pool_id        = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "avd-poc-appgroup"
      + resource_group_name = "rg-avd-dev"
      + tags                = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
      + type                = "Desktop"
    }

  # module.avd-hostpool.azurerm_virtual_desktop_host_pool.avd_hostpool will be created
  + resource "azurerm_virtual_desktop_host_pool" "avd_hostpool" {
      + description              = "Host pool for AVD POC environment"
      + friendly_name            = "AVD POC Host Pool"
      + id                       = (known after apply)
      + load_balancer_type       = "DepthFirst"
      + location                 = "eastus"
      + maximum_sessions_allowed = 999999
      + name                     = "avd-poc"
      + preferred_app_group_type = "Desktop"
      + public_network_access    = "Enabled"
      + resource_group_name      = "rg-avd-dev"
      + start_vm_on_connect      = false
      + tags                     = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
      + type                     = "Pooled"
      + validate_environment     = false
    }

  # module.avd-hostpool.azurerm_virtual_desktop_host_pool_registration_info.registration_info will be created
  + resource "azurerm_virtual_desktop_host_pool_registration_info" "registration_info" {
      + expiration_date = (known after apply)
      + hostpool_id     = (known after apply)
      + id              = (known after apply)
      + token           = (sensitive value)
    }

  # module.avd-hostpool.azurerm_virtual_desktop_workspace.workspace will be created
  + resource "azurerm_virtual_desktop_workspace" "workspace" {
      + description                   = "AVD POC Workspace"
      + friendly_name                 = "AVD POC Workspace"
      + id                            = (known after apply)
      + location                      = "eastus"
      + name                          = "avd-poc-workspace"
      + public_network_access_enabled = true
      + resource_group_name           = "rg-avd-dev"
      + tags                          = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
    }

  # module.avd-hostpool.azurerm_virtual_desktop_workspace_application_group_association.workspace_app_group_association will be created
  + resource "azurerm_virtual_desktop_workspace_application_group_association" "workspace_app_group_association" {
      + application_group_id = (known after apply)
      + id                   = (known after apply)
      + workspace_id         = (known after apply)
    }

  # module.avd-hostpool.azurerm_virtual_machine_extension.vmext_dsc["0"] will be created
  + resource "azurerm_virtual_machine_extension" "vmext_dsc" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "avd-poc-vm0-avd_dsc"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Powershell"
      + settings                    = jsonencode(
            {
              + configurationFunction = "Configuration.ps1\\AddSessionHost"
              + modulesUrl            = "https://wvdportalstorageblob.blob.core.windows.net/galleryartifacts/Configuration_1.0.02714.342.zip"
              + properties            = {
                  + HostPoolName = "avd-poc"
                }
            }
        )
      + type                        = "DSC"
      + type_handler_version        = "2.73"
      + virtual_machine_id          = (known after apply)
    }

  # module.avd-hostpool.azurerm_virtual_machine_extension.vmext_dsc["1"] will be created
  + resource "azurerm_virtual_machine_extension" "vmext_dsc" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "avd-poc-vm1-avd_dsc"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Powershell"
      + settings                    = jsonencode(
            {
              + configurationFunction = "Configuration.ps1\\AddSessionHost"
              + modulesUrl            = "https://wvdportalstorageblob.blob.core.windows.net/galleryartifacts/Configuration_1.0.02714.342.zip"
              + properties            = {
                  + HostPoolName = "avd-poc"
                }
            }
        )
      + type                        = "DSC"
      + type_handler_version        = "2.73"
      + virtual_machine_id          = (known after apply)
    }

  # module.avd-hostpool.azurerm_windows_virtual_machine.avd_vm["0"] will be created
  + resource "azurerm_windows_virtual_machine" "avd_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "blah"
      + allow_extension_operations                             = (known after apply)
      + automatic_updates_enabled                              = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + enable_automatic_updates                               = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = (known after apply)
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "avd-poc-vm0"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-avd-dev"
      + size                                                   = "Standard_B2ls_v2"
      + tags                                                   = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 100
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "windows-11"
          + publisher = "MicrosoftWindowsDesktop"
          + sku       = "win11-25h2-avd"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.avd-hostpool.azurerm_windows_virtual_machine.avd_vm["1"] will be created
  + resource "azurerm_windows_virtual_machine" "avd_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "blah"
      + allow_extension_operations                             = (known after apply)
      + automatic_updates_enabled                              = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + enable_automatic_updates                               = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = (known after apply)
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "avd-poc-vm1"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-avd-dev"
      + size                                                   = "Standard_B2ls_v2"
      + tags                                                   = {
          + "environment" = "poc"
          + "managedBy"   = "Terraform"
          + "project"     = "avd-capstone"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 100
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "windows-11"
          + publisher = "MicrosoftWindowsDesktop"
          + sku       = "win11-25h2-avd"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @vanoeski, Action: `pull_request`*